{
    "title": "Difficultés rencontrées et solutions",
    "shortDescription": "Un regard sur les défis que j'ai rencontrés lors de mes missions et les solutions apportées.",
    "publicationDate": "2024-09-08",
    "intro": "Chaque projet présente des défis, et mon stage chez Flying Eye n'a pas fait exception. Face à un environnement technique exigeant, plusieurs difficultés ont émergé au fil des missions. Cependant, ces obstacles ont également été l'occasion de développer des solutions innovantes et efficaces.",
    "sections": {
        "stockSystem": {
            "title": "Difficulté : Mise en place du système de gestion de stock",
            "details": "La conception du système de gestion de stock s'est avérée complexe en raison de la nécessité de gérer une grande quantité de données en temps réel. La synchronisation des informations entre la base de données et l'interface utilisateur devait être fluide, tout en prenant en compte les performances. Cette gestion des stocks nécessitait également une sécurité accrue pour éviter toute perte ou manipulation de données."
        },
        "solution1": {
            "title": "Solution : Structurer le développement en étapes",
            "details": "Pour surmonter ces défis, j'ai structuré le développement en différentes étapes. D'abord, j'ai défini un modèle de données clair en utilisant Sequelize pour gérer les relations entre les différentes entités. Ensuite, j'ai mis en place une architecture front-end efficace en React pour assurer une fluidité dans la navigation et l'affichage des données en temps réel. Chaque étape du développement était suivie de tests rigoureux pour assurer la robustesse de l'application."
        },
        "deployment": {
            "title": "Difficulté : Déploiement sur un serveur local",
            "details": "Le déploiement sur un serveur local présentait également des défis. En particulier, la gestion des ressources système et la configuration de Nginx pour assurer une disponibilité constante du système étaient des aspects critiques. De plus, la gestion des logs et la surveillance des erreurs devaient être optimisées pour garantir la stabilité de l'application."
        },
        "solution2": {
            "title": "Solution : Automatisation et suivi des logs",
            "details": "J'ai mis en place un système d'automatisation à l'aide de PM2 pour gérer les processus Node.js et assurer la résilience du serveur. En parallèle, des outils de suivi de logs ont été configurés pour surveiller en temps réel les performances du système et détecter les erreurs avant qu'elles ne deviennent critiques."
        },
        "conclusion": {
            "title": "Conclusion",
            "details": "Les difficultés rencontrées au cours de mon stage ont été formatrices. Elles m'ont permis de développer des solutions techniques adaptées, tout en apprenant à mieux gérer les contraintes liées à la gestion de projet et au déploiement d'applications complexes."
        }
    }
}